<template>
    <div>
        <div class="box">
            <h4>{{name}}斗地主赚金版用户协议与隐私条款</h4>
            <p>欢迎您使用{{name}}斗地主赚金版游戏及相关服务!</p>
            <p class="indentation">在此特别提醒您(用户)在注册成为用户之前,请认真阅读本《用户协议》 (以下简称"本协议") ,确保您充分理解本协议中各条款,特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、同意开通的条款、法律适用和争议解决条款等。其中,免除或者限制责任条款等重要内容将以加粗形式提示您注意,您应重点阅读。如您未满18周岁,请您在法定监护人陪同下仔细阅读并充分理解本协议,并征得法定监护人的同意后下载本游戏。请您审慎阅读并选择接受或不接受本协议。</p>
            <p class="indentation"><b>除非您接受本协议所有条款,否则您无权注册、登录或使用(以下统称"使用") "{{name}}斗地主赚金版"游戏软件或者通过任何方式使用"{{name}}斗地主赚金版"服务,或者获得"{{name}}斗地主赚金版"游戏软件提供的任何服务。若您使用"{{name}}斗地主赚金版”游戏软件及相关服务(以下简称“本服务") ,则视为您已充分理解本协议,并承诺作为本协议的一方当事人接受本协议各项条款的约束。</b>"{{name}}斗地主赚金版”游戏软件服务由北京{{companyNmae}}网络科技有限公司("{{companyNmae}}”、"公司")开发并发布。本协议约定{{companyNmae}}与用户之间关于"{{name}}斗地主赚金版"游戏软件服务(以下简称"服务")的权利义务。</p>
            <p class="bold">《健康游戏忠告》</p>
            <p class="bold indentation">抵制不良游戏,拒绝盗版游戏。注意自我保护,谨防受骗上当。适度游戏益脑,沉迷游戏伤身。合理安排时间,享受健康生活。倡导理性消费,享受竞技快乐。</p>
            <p class="bold indentation padding-5">严禁恶意利用本游戏进行赌博等违法犯罪行为,一经发现，立即封停账号、并向公安机关举报。</p>
            <p class="bold">一、定义</p>
            <p class="indentation">1.1,用户:指所有直接或间接获取和使用"{{name}}斗地主赚金版"游戏软件及相关服务的自然人、法人和其他组织等。在本协议中称为"用户"、"玩家"或称"您”。</p>
            <p class="indentation">1.2.{{name}}斗地主赚金版:指由公司合法拥有并运营的、标注名称为“{{name}}斗地主赚金版"的客户端应用程序以及"{{name}}斗地主赚金版" ({{website}})的网站,公司向用户提供以轻游戏内容和创新的游戏体验的新型服务</p>
            <p class="indentation">1.3,本协议内容同时包括公司已经发布及后续可能不断发布的关于"{{name}}斗地主赚金版"游戏软件及相关服务的相关协议、规则等内容,同时还包括文化部依据《网络游戏管理暂行办法》 (文化部令第49号)制定的《网络游戏服务格式化协议必备条款》 (详见附录) 。前述内容一经正式发布,并以适当的方式送达用户(站内信、系统通知等) ,即为本协议不可分割的组成部分,您应同样遵守。若用户不接受修改后的条款,请立即停止使用服务,用户继续使用服务视为接受修改后的协议。</p>
            <p class="indentation">1.4游戏规则:指{{companyNmae}}不时发布并修订的关于游戏的用户协议、游戏规则、游戏公告及通知、指引、说明等内容。</p>
            <p class="indentation padding-5">1.5游戏数据:指您在使用{{companyNmae}}服务过程中产生的并存储于服务器的各种数据信息,包括游戏日志、安全日志等。</p>
            <p class="bold">二、账号注册</p>
            <p class="indentation">2.1,用户在使用本服务前需要注册一个"{{name}}斗地主赚金版"账号,新用户登录即自动注册账户。"{{name}}斗地赚金版"账号目前仅能通过手机号验证来不排除将引入微信验证登录等其他第三方账户体系用于登录本应用,请用户使用尚未与"{{name}}斗地主赚金版"账号绑定的手机号码,以及未被{{companyNmae}}根据本协议封禁的手机号码注册"{{name}}斗地主赚金版"账号。{{companyNmae}}可以根据用户需求或产品需要对账号注册和绑定的方式进行变更,而无须事先通知用户。用户的手机号码,是用户登录并以注册用户身份使用本服务的凭证。依照国家相关法律法规的规定,您使用本服务,注册时需要您提供真实有效的身份信息进行验证,同时需您及时完善、更新注册资料,来行使对{{name}}斗地主赚金版账户使用和管理。注册时{{name}}斗地主赚金版有权审查您提交的相关身份信息并进行验证,可能还需您提供相关证明材料(如自然人身份证复印件、企业法人营业执照副本复印件和事业单位法人证书复印件、公司官方声明/说明等,有权决定是否对您进行核查并核准您的注册申请。如未进行或未通过实名认证,公司依据法律规定将拒绝为您提供相关服务。您可以按照公司说明申请注销账号,公司会在完成个人身份、安全状态、设备信息等合理和必要的验证后协助您注销账号,并依照您的要求删除有关您账号的一切信息,法律法规另有规定的除外。</p>
            <p class="indentation">2.2,您必须承诺和保证:</p>
            <p class="indentation bold">1)您了解并同意,用户须对注册信息的真实性、合法性、有效性承担全部责任;用户不得冒充他人,不得利用他人的名义发布任何信息;不得恶意使用注册帐号导致其他用户误认;否则我们有权立即停止提供服务,您独自承担由此而产生的一切法律责任。</p>
            <p class="indentation bold">2)您理解并承诺,您所设置的账号不得违反国家法律法规及{{companyNmae}}的相关规则，您的账号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息,未经他人许可不得用他人名义(包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式)开设账号,不得恶意注册"{{name}}斗地主赚金版"账号(包括但不限于频繁注册、批量注册账号等行为)。您在账号注册及使用过程中需遵守相关法律法规,不得实施任何侵害国家利益、损害其他公民合法权益,有害社会道德风尚的行为。{{companyNmae}}有权对您提交的注册信息进行审核。</p>
            <p class="indentation bold">3)您在"{{name}}斗地主赚金版"中的注册账号所有权及有关权益均归公司所有,您完成注册手续后仅享有该账号的使用权。您的账号仅限于您本人使用,未经公司书面同意,禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果公司发现或者有合理理由认为使用者并非账号初始注册人,公司有权在未通知您的情况下,暂停或终止向该注册账号提供服务,并有权注销该账号,而无需向注册该账号的用户承担法律责任。若您注册后长期(连续30天)不登录"{{name}}斗地主赚金版"进行活动,公司有权单方将用户账户中的余额清零,账号进行初始化。</p>
            <p class="indentation">4)您有责任维护个人账号、手机号、手机验证码的安全性与保密性,并对您以注册账号名义所从事的活动承担全部法律责任,包括但不限于您在"{{name}}斗地主赚金版"上进行的任何数据修改、言论发表、款项支付等操作行为。您应高度重视对账号、手机号及验证码的保密,在任何情况下不向他人透露账号、手机号及验证码。若发现他人未经许可使用您的账号或发生其他任何安全漏洞问题时,您应当立即通知公司。</p>
            <p class="indentation">5)因您自身原因或其他不可抗因素而导致账号被盗、丢失,均由您本人承担责任,公司不承担任何责任。</p>
            <p class="indentation padding-5">2.3,您如果需要使用和享受{{companyNmae}}服务,您需要按照《网络游戏管理暂行规定》及文化部《网络游戏服务格式化协议必备条款》的要求,登陆实名注册系统并进行实名注册。您充分理解并同意:{{companyNmae}}会按照国家相关要求将您的实名注册信息运用于防沉迷系统之中,即{{companyNmae}}可能会根据您的实名注册信息判断您是否年满18周岁,从而决定是否对您的游戏账号予以防沉迷限制。并且,若您未满18周岁,{{companyNmae}}会根据有关规则及您家长的要求对您的账户进行限制。</p>
            <p class="bold">三、隐私政策</p>
            <p class="indentation">3.1保护用户个人信息是公司的一项基本原则。公司依据法律法规收集、使用个人信息,坚持遵循个人信息收集、使用的合法、正当、必要的原则。在使用"{{name}}斗地主赚金版"游戏软件及相关服务前,请您务必仔细阅读并透彻理解本隐私政策,公司可能会收集和使用您的相关信息,您一旦选择使用“{{name}}斗地主赚金版"游戏软件及相关服务,即意味着同意公司按照本隐私政策收集、保存、使用、共享、披露及保护您的信息。</p>
            <p class="indentation">3.2本平台可能收集的信息:</p>
            <p class="indentation">1)您可能提供的信息。</p>
            <p class="indentation">当您在本平台进行用户注册登记或使用本平台提供的服务时,您向本平台提供的一些个人资料,如个人身份证明(包括身份证、护照、驾驶证等) ;生日、籍贯、性别、兴趣爱好、个人电话号码、面部特征;网络身份标识信息(包括系统账号、IP地址、电子邮箱地址及与前述有关的密码、口令、口令保护答案等) ;个人财产信息(交易记录、余额、优惠券、游戏类兑换码、银行卡信息等) ;通讯信息;个人上网记录和日志信息(包括网站浏览记录、游戏软件使用记录、点击记录、操作日志等) ;设备信息(包括设备型号、设备MAC地址、操作系统类型、设备设置) ;游戏软件列表唯一设备识别码(如IME/android ID/DFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息) ;位置信息(包括行程信息、精准定位信息、住宿信息、经纬度等) 。一般情况下,您可随时查看、修改自己提交的信息,但出于安全性和身份识别(如号码申诉服务)的考虑,您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
            <p class="indentation">2)公司可能收集的信息</p>
            <p class="indentation">a)日志信息。</p>
            <p class="indentation">当您使用公司提供的服务时,公司可能会通过cookies, web beacon或其他方式自动采集一些与您个人身份无关的日志信息。这些信息包括: 1)设备或应用信息,例如您使用的硬件设备、网页浏览器或用于接入本平台服务的其他程序所提供的配置信息、您的IP地址、您所使用的硬件设备的版本及设备识别码等; 2)上网记录,例如您的搜索记录、浏览记录、点击记录等。</p>
            <p class="indentation">b)位置信息。</p>
            <p class="indentation">当您通过具有定位功能的移动设备使用本平台提供的服务时,系统会通过GPS或WIFI等方式收集的您的地理位置信息。您可以通过关闭定位功能,停止对您的地理位置信息的收集。</p>
            <p class="indentation">c)游戏信息。</p>
            <p class="indentation">您账号下的游戏数据以及其他您在使用游戏服务的过程中向{{companyNmae}}提供的或{{companyNmae}}基于安全、用户体验优化等考虑而需收集的信息,{{companyNmae}}对您的用户信息的收集将遵循相关法律的规定。</p>
            <p class="indentation">3.3公司可能如何使用信息</p>
            <p class="indentation">公司可能将所收集的信息用作如下用途:1)向您提供服务;</p>
            <p class="indentation">2)帮助本平台产品及服务的设计、优化和升级;</p>
            <p class="indentation">3)向您提供个性化服务,例如向您展示、推送与您更加相关的内容和广告;</p>
            <p class="indentation">4)用于身份验证、安全防范、存档和备份,确保服务的安全性。</p>
            <p class="indentation">5)用于向您提供关于{{companyNmae}}的活动信息、推广信息等各类信息。</p>
            <p class="indentation">3.4信息的保护</p>
            <p class="indentation">公司将运用各种安全技术和程序来建立完善的管理制度来保护您的个人信息。</p>
            <p class="indentation">3.5信息的合理利用及披露原则</p>
            <p class="indentation bold">公司不会将您的个人信息转移或披露给任何非关联的第三方,除非:</p>
            <p class="indentation bold">1)事先获得您的明确授权同意;</p>
            <p class="indentation bold">2)相关法律法规或法院、政府机关要求;</p>
            <p class="indentation bold">3)为完成合并、分立、收购或资产转让而转移,但公司会要求新的持有您的个人信息的公司、组织继续受本隐私政策的约束,否则,公司有权要求该公司、组织重新取得您的授权同意;</p>
            <p class="indentation bold">4)在法律法规允许的范围内,为维护"{{name}}斗地主赚金版"其他用户、公司及其关联公司、控制公司的生命、财产等合法权益或维权产品或服务的安全稳定运行所必需的,例如查找、预防、处理欺诈等违法活动和减少信用风险等;</p>
            <p class="indentation bold">5)公司为维护合法权益而向用户提起诉讼或仲裁;</p>
            <p class="indentation bold">6)以维护公共利益或学术研究为目的;</p>
            <p class="indentation bold">7)或为提供您要求的服务所必需或法律法规规定的其他情形。</p>
            <p class="indentation">为提升本平台服务的质量,并向您提供相关服务的全部功能,本平台可能会通过关联公司及与第三方合作共同向用户提供相关的服务,此类合作可能需要本平台与其分享必要的信息,但本平台会要求其确保数据安全并且禁止用于任何其他用途。</p>
            <p class="bold padding-5">请您注意,公司在您使用相关产品或服务时不会让您提供任何财产账户、银行卡、信用卡、第三方支付账户及对应密码等,请勿在使用服务中透露自己的各类财产账户、银行卡、信用卡、第三方支付账户及对应密码等重要资料,否则由此带来的任何损失由您自行承担。您不应将个人信息通过"{{name}}斗地主赚金版”上发表、上传或扩散。</p>
            <p class="bold">四、基于游戏提供服务</p>
            <p class="indentation">公司依托”{{name}}斗地主赚金版”游戏软件向您提供服务,您还应遵守以下约定:</p>
            <p class="indentation">4.1您在使用本服务的过程中可能需要下载游戏,对于这些游戏,公司给予您一项个人的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用这些游戏。同时,{{companyNmae}}将向您提供游戏服务作为休闲娱乐之用,{{companyNmae}}严禁一切形式的赌博和其他违法犯罪活动。请您适度游戏,{{companyNmae}}将与您共同打造绿色的休闲平台。</p>
            <p class="indentation">4.2您使用"{{name}}斗地主赚金版"游戏及相关服务,可以通过预装、公司已授权的第三方下载等方式获取"{{name}}斗地主赚金版"客户端应用程序或访问{{name}}斗地主赚金版官网等相关网站。若您并非从公司或经公司授权的第三方获取本游戏的,公司无法保证非官方版本的"{{name}}斗地主赚金版"游戏能够正常使用,您因此遭受的损失与公司无关。</p>
            <p class="indentation">4.3为了改善用户体验、保证服务的安全性及产品功能的一致性,公司可能会对游戏进行更新。您应该将相关游戏更新到最新版本,否则公司并不保证其能正常使用,您有权选择接受更新版本或服务,如您不接受,部分功能将受到限制或不能继续使用。如您不再需要使用"{{name}}斗地主赚金版"游戏及相关服务可自行卸载。</p>
            <p class="indentation">4.4除非公司书面许可,您不得从事下列任一行为:</p>
            <p class="indentation">1)删除游戏软件及其副本上关于著作权的信息;</p>
            <p class="indentation">2)对游戏软件进行反向工程、反向汇编、反向编译,或者以其他方式尝试发现游戏软件的源代码;</p>
            <p class="indentation">3)建立有关{{companyNmae}}的镜像站点,或者进行网页(络)快照,或者利用架设服务器等方式,为他人提供与本游戏服务完全相同或者类似的服务;</p>
            <p class="indentation">4)对游戏或者游戏运行过程中释放到任何终端内存中的数据、游戏运行过程中客户端与服务器端的交互数据,以及游戏运行所必需的系统数据,进行复制、修改、增加、删除、挂接运行或创作任何衍生作品,形式包括但不限于使用插件、外挂或非经公司授权的第三方工具/服务接入软件和相关系统;</p>
            <p class="indentation">5)通过修改或伪造游戏运行中的指令、数据,增加、删减、变动游戏的功能或运行效果,或者将用于上述用途的游戏、方法进行运营或向公众传播,无论这些行为是否为商业目的;</p>
            <p class="indentation">6)通过非公司开发、授权的第三方软件、插件、外挂、系统,登录或使用公司游戏及服务,或制作、发布、传播非公司开发、授权的第三方软件、插件、外挂、系统。</p>
            <p class="indentation">7)使用{{companyNmae}}的名称、商标或其它知识产权;</p>
            <p class="indentation">8)其他未经{{companyNmae}}明示授权的行为。</p>
            <p class="indentation">4.5您在使用{{companyNmae}}的收费功能时,应当按照闲i互娱的要求支付相应的费用。该权利属于{{companyNmae}}的经营自主权,{{companyNmae}}保留随时改变经营模式的权利,即保留变更收费的费率标准、收费的软件功能、收费对象及收费时间等权利。同时,也保留对{{companyNmae}}进行升级、改版,增加、删除、修改、变更其功能或者变更其游戏规则的权利。用户如果不接受该等变更的,应当立即停止使用{{companyNmae}};用户继续使用本游戏的行为,视为用户接受改变后的经营模式。</p>
            <p class="indentation">4.6为保障玩家的正当利益,{{companyNmae}}对盗号及盗号相关行为(包括但不限于盗取账号、游戏数据、玩家个人资料、协助盗号者操作等)予以严厉打击和处罚。-经查证属实或应有权机关要求,{{companyNmae}}有权视具体情况立即采取封号等处罚措施,情节严重的,{{companyNmae}}保留对涉案玩家追究法律责任的权利。</p>
            <p class="indentation">4.7如果{{companyNmae}}发现或收到他人举报或投诉用户违反本协议约定的,经查证属实,{{companyNmae}}有权不经通知随时对相关内容进行删除,并视行为情节对违规账号处以包括但不限于警告、限制或禁止使用全部或部分功能、封号甚至终止服务的处罚。</p>
            <p class="indentation">4.8您充分理解并同意,因您违反本协议或相关规则的规定,导致或产生第三方主张的任何索赔、要求或损失,您应当独立承担责任;{{companyNmae}}因此遭受损失的,您也应一并赔偿。</p>
            <p class="indentation">4.9{{companyNmae}}可能会通过{{companyNmae}}官方网站、{{companyNmae}}客服官方网站、客服电话、{{companyNmae}}微信公众号、管理员或者其他的途径,向用户提供诸如游戏规则说明、BUG或外挂投诉、账号锁定或解除锁定、帐号申诉、帐号暂时封停、游戏帐号实名注册信息修改和/或查验等客户服务。</p>
            <p class="indentation">4.10您充分了解并同意,您必须为自己账号下的一切行为负责,包括您所发表的任何内容以及由此产生的任何后果。您应对本游戏中的内容自行加以判断,并承担因使用本游戏而引起的所有风险,包括因对本游戏内容的正确性、完整性或实用性的依赖而产生的风险。{{companyNmae}}无法且不会对因前述风险而导致的任何损失或损害承担责任。</p>
            <p class="indentation">4.11您在使用本游戏服务过程中有如下行为的,{{companyNmae}}将视情节严重程度,依据本协议及相关游戏规则的规定,对您暂时或永久性地做出禁言(关闭聊天功能) 、强制离线、封号(暂停游戏账户) 、终止服务等处理措施,情节严重的将移交有关机关给予行政处罚,甚至向公安机关举报、追究您的刑事责任:</p>
            <p class="indentation">1)假冒{{companyNmae}}工作人员或其他客户服务人员；</p>
            <p class="indentation">2)传播非法言论或不当信息,包括使用非法或不当词语、字符等用于用户命名;</p>
            <p class="indentation">3)对{{companyNmae}}工作人员或其他玩家进行辱骂、人身攻击等;不断吵闹、重复发言、不断发布广告、恶意刷屏等,以及恶意连续骚扰他人,影响他人游戏等其他行为；</p>
            <p class="indentation">4)以任何方式破坏本游戏或影响本游戏软件服务的正常进行;</p>
            <p class="indentation">5)各种非法外挂行为;</p>
            <p class="indentation">6)利用系统的BUG、漏洞为自己及他人牟利;</p>
            <p class="indentation">7)利用本游戏软件进行赌博；</p>
            <p class="indentation">8)侵犯{{companyNmae}}的知识产权,或者进行其他有损于本游戏或第三方合法权益的行为;</p>
            <p class="indentation">9)通过各种方式侵入服务器,干扰服务器的正常运行,接触、拷贝、篡改、增加、删除游戏数据;</p>
            <p class="indentation padding-5">10)其他在行业内被广泛认可的不当行为,无论是否已经被本协议或游戏规则明确列明。</p>
            <p class="bold">五、知识产权政策</p>
            <p class="indentation">5.1{{companyNmae}}是本应用的知识产权权利人。相关的著作权、商标权、专利权、商业秘密等知识产权,以及其他信息内容(包括文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等)均受中华人民共和国法律和相应国际条约保护,{{companyNmae}}享有上述知识产权,但相关权利人依照法律规定应享有的权利除外。</p>
            <p class="indentation">5.2您在使用{{companyNmae}}服务中产生的游戏数据的所有权和知识产权归{{companyNmae}}所有,{{companyNmae}}有权处置该游戏数据。</p>
            <p class="indentation padding-5">5.3{{companyNmae}}可能涉及第三方知识产权,而该等第三方对您基于本协议在{{companyNmae}}中使用该等知识产权有要求的,您应当一并遵守。</p>
            <p class="bold">六、违约处理</p>
            <p class="indentation bold">6.1针对您违反本协议或其他服务条款的行为,公司有权独立判断并视情况采取预先警示、拒绝发布、立即停止传输信息、删除、短期封号、限制账号部分或者全部功能直至永久关闭注销账号等措施。公司有权公告处理结果,且有权根据实际情况决定是否恢复使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录,并依法向有关主管部门报告、配合有关主管部门调查。</p>
            <p class="indentation bold">6.2因您违反本协议或其他服务条款规定,引起第三方投诉或诉讼索赔的,您应当自行承担全部法律责任。因您的违法或违约行为导致公司及其关联公司、控制公司向任何第三方赔偿或遭受国家机关处罚的,您还应足额赔偿公司及其关联公司、控制公司因此遭受的全部损失。</p>
            <p class="indentation bold padding-5">6.3因您违反本协议或其他服务条款规定,造成公司向任何第三方承担责任的,公司在承担所述责任后有权向用户足额追偿，由此产生的合理费用包括但不限于,律师费、公证费、鉴定费、差旅费、诉讼费等亦由用户承担。</p>
            <p class="bold">七、免责声明</p>
            <p class="indentation bold">7.1您理解并同意,在使用本服务的过程中,可能会遇到不可抗力等风险因素,使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件,包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为、黑客攻击、程序崩溃等。出现上述情况时,公司将努力在第一时间与相关单位配合,及时进行修复,但是由此给您造成的损失公司在法律允许的范围内免责。</p>
            <p class="indentation bold">7.2您理解并同意,在使用本服务的过程中,可能会因游戏软件BUG、版本更新缺陷、运营BUG、第三方病毒攻击或其他任何因素导致您无法登陆账号,或导致您的账号数据发生异常。在数据异常的原因未得到查明前,{{companyNmae}}有权暂时冻结该账号;若查明数据异常为非正常游戏行为,您游戏账号数据将可能被恢复至异常发生前的原始状态，{{companyNmae}}对此免责。</p>
            <p class="indentation bold">7.3在法律允许的范围内,公司对以下情形导致的服务中断或受阻不承担责任:</p>
            <p class="indentation bold">1)受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</p>
            <p class="indentation bold">2)用户或公司的电脑游戏软件、系统、硬件和通信线路出现故障;</p>
            <p class="indentation bold">3)用户操作不当;</p>
            <p class="indentation bold">4)用户通过非公司授权的方式使用本服务;</p>
            <p class="indentation bold">5)其他公司无法控制或合理预见的情形。</p>
            <p class="indentation bold">7.4您理解并同意,"{{name}}斗地主赚金版”游戏软件及相关服务可能会受多种因素的影响或干扰,公司不保证(包括但不限于):</p>
            <p class="indentation bold">1)公司完全适合用户的使用要求;</p>
            <p class="indentation bold">2)公司不受干扰,及时、安全、可靠或不出现错误;您经由公司取得的任何软件、游戏、服务或其他材料符合用户的期望;</p>
            <p class="indentation bold">3)游戏软件中任何错误都将能得到更正。</p>
            <p class="indentation bold">7.5您理解并同意,在使用本服务的过程中,可能会遇到网络信息或其他用户行为带来的风险,公司不对任何信息的真实性、适用性、合法性承担责任,也不对因侵权行为给您造成的损害负责。这些风险包括但不限于:</p>
            <p class="indentation bold">1)来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息;</p>
            <p class="indentation bold">2)因使用本协议项下的服务,遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失;</p>
            <p class="indentation bold">3)其他因网络信息或用户行为引起的风险。</p>
            <p class="indentation bold">7.6对于涉嫌借款或其他涉财产的网络信息、账户密码、广告或推广等信息的,请您谨慎对待并自行进行判断，基于前述原因您因此遭受的利润、商业信誉、资料损失或其他有形或无形损失,公司不承担任何直接、间接、附带、特别、衍生性或惩罚性的赔偿责任。</p>
            <p class="indentation bold">7.7您理解并同意,本服务并非为某些特定目的而设计,包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域。如果因为游戏软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等,公司不承担法律责任。</p>
            <p class="indentation bold">7.8公司依据本协议约定获得处理违法违规内容的权利,该权利不构成公司的义务或承诺,公司不能保证及时发现违法行为或进行相应处理。</p>
            <p class="indentation bold">7.9在任何情况下,您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的,请一定先核实对方身份,并请经常留意公司有关防范诈骗犯罪的提示。</p>
            <p class="indentation bold padding-5">7.10由于互联网服务的特殊性,{{companyNmae}}有权根据法律法规的规定及相关主管部门的要求、第三方权利人的投诉举报、与合作方的合作情况,以及{{companyNmae}}业务发展情况,随时变更、中断或终止本服务的部分或全部内容。</p>
            <p class="bold">八、服务的变更、生效、中断、终止</p>
            <p class="indentation">8.1您理解并同意,公司提供的服务是按照现有技术和条件所能达到的现状提供的。公司会尽最大努力向您提供服务,确保服务的连贯性和安全性。您理解,公司不能随时预见和防范技术以及其他风险,包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵及其他各种安全问题的侵扰等原因可能导致的服务中断、数据丢失以及其他的损失和风险。</p>
            <p class="indentation">8.2{{companyNmae}}有权根据需要不时修订本协议条款。</p>
            <p class="indentation">上述内容一经正式公布即生效。您可以在{{companyNmae}}的相关页面查阅最新版本的协议条款。</p>
            <p class="indentation">8.3本协议条款变更后,如果您继续使用本游戏服务,即视为您已接受变更后的协议。如果您不接受变更后的协议,应当立即停止使用本游戏服务。</p>
            <p class="indentation">8.4除非本协议另有其它明示规定,{{companyNmae}}所推出的新产品、新功能、新服务,均受到本协议之规范。</p>
            <p class="indentation padding-5">8.5您理解并同意,公司为了服务整体运营的需要,有权在公告通知后中断、中止或终止相关服务,而无须向用户负责或承担任何赔偿责任。</p>
            <p class="bold">九、管辖与法律适用</p>
            <p class="indentation">9.1本协议的成立、生效、履行、解释及纠纷解决,适用中华人民共和国大陆地区法律(不包括冲突法,</p>
            <p class="indentation">9.2本协议签订地为中华人民共和国北京市。</p>
            <p class="indentation">9.3若您和公司之间发生任何纠纷或争议,首先应友好协商解决;协商不成的,您同意将纠纷或争议提交本协议签订地(即中华人民共和国北京市)有管辖权的人民法院管辖。</p>
            <p class="indentation">9.4本协议所有条款的标题仅为阅读方便,本身并无实际涵义,不能作为本协议涵义解释的依据。</p>
            <p class="indentation padding-5">9.5本协议条款无论因何种原因部分无效或不可执行,其余条款仍有效,对双方具有约束力。</p>
            <p>附录: 《网络游戏服务格式化协议必备条款》</p>
            <p>1.账号注册</p>
            <p>1.1乙方承诺以其真实身份注册成为甲方的用户,并保证所提供的个人身份资料信息真实、完整、有效,依据法律规定和必备条款约定对所提供的信息承担相应的法律责任。</p>
            <p>1.2乙方以其真实身份注册成为甲方用户后,需要修改所提供的个人身份资料信息的,甲方应当及时、有效地为其提供该项服务。</p>
            <p>2用户账号使用与保管</p>
            <p>2.1根据必备条款的约定,甲方有权审查乙方注册所提供的身份信息是否真实、有效,并应积极地采取技术与管理等合理措施保障用户账号的安全、有效;乙方有义务妥善保管其账号及密码,并正确、安全地使用其账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给乙方和他人的民事权利造成损害的,应当承担由此产生的法律责任。</p>
            <p>2.2乙方对登陆后所持账号产生的行为依法享有权利和承担责任。</p>
            <p>2.3乙方发现其账号或密码被他人非法使用或有使用异常的情况的,应及时根据甲方公布的处理方式通知甲方,并有权通知甲方采取措施暂停该账号的登陆和使用。</p>
            <p>2.4甲方根据乙方的通知采取措施暂停乙方账号的登陆和使用的,甲方应当要求乙方提供并核实与其注册身份信息相一致的个人有效身份信息。</p>
            <p>2.4.1甲方核实乙方所提供的个人有效身份信息与所注册的身份信息相一致的,应当及时采取措施暂停乙方账号的登陆和使用。</p>
            <p>2.4.2甲方违反2.4.1款项的约定,未及时采取措施暂停乙方账号的登陆和使用,因此而给乙方造成损失的,应当承担其相应的法律责任。</p>
            <p>2.4.3乙方没有提供其个人有效身份证件或者乙方提供的个人有效身份证件与所注册的身份信息不一致的,甲方有权拒绝乙方上述请求。</p>
            <p>2.5乙方为了维护其合法权益,向甲方提供与所注册的身份信息相一致的个人有效身份信息时,甲方应当为乙方提供账号注册人证明、原始注册信息等必要的协助和支持,并根据需要向有关行政机关和司法机关提供相关证据信息资料。</p>
            <p>3服务的中止与终止</p>
            <p>3.1乙方有发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为,甲方应当立即终止对乙方提供服务。</p>
            <p>3.2乙方在接受甲方服务时实施不正当行为的,甲方有权终止对乙方提供服务。该不正当行为的具体情形应当在本协议中有明确约定或属于甲方事先明确告知的应被终止服务的禁止性行为,否则,甲方不得终止对乙方提供服务。</p>
            <p>3.3乙方提供虚假注册身份信息,或实施违反本协议的行为,甲方有权中止对乙方提供全部或部分服务;甲方采取中止措施应当通知乙方并告知中止期间,中止期间应该是合理的,中止期间届满甲方应当及时恢复对乙方的服务。</p>
            <p>3.4甲方根据本条约定中止或终止对乙方提供部分或全部服务的,甲方应负举证责任。</p>
            <p>4用户信息保护</p>
            <p>4.1甲方要求乙方提供与其个人身份有关的信息资料时,应当事先以明确而易见的方式向乙方公开其隐私权保护政策和个人信息利用政策,并采取必要措施保护乙方的个人信息资料的安全。</p>
            <p>4.2未经乙方许可甲方不得向任何第三方提供、公开或共享乙方注册资料中的姓名、个人有效身份证件号码、联系方式、家庭住址等个人身份信息,但下列情况除外:</p>
            <p>4.2.1乙方或乙方监护人授权甲方披露的;</p>
            <p>4.2.2有关法律要求甲方披露的;</p>
            <p>4.2.3司法机关或行政机关基于法定程序要求甲方提供的</p>
            <p>4.2.4甲方为了维护自己合法权益而向乙方提起诉讼或者仲裁时;</p>
            <p style="padding-bottom:1rem">4.2.5应乙方监护人的合法要求而提供乙方个人身份信息时。</p>
        </div>
    </div>
</template>

<script>
export default {
    name: "UserAgreement",
    data(){
        return {
            name:'多狐', // 游戏名字
            website:'http://www.jiexunjiayin.com', // 官方网站
            companyNmae: '捷讯佳音' // 公司名称
        }
    }
}
</script>

<style scoped>
.box {
    font-size: .38rem;
    padding: 0 .47rem;
}
p {
    margin: 0;
    padding-bottom: .15rem;
    font-size: .38rem;
}
h4 {
    font-size: .6rem;
    text-align: center;
    padding: 0 .7rem;
    margin: .8rem 0 1.15rem;
}
.bold {
    font-weight: 700;
}
.indentation {
    text-indent:2em;
}
.padding-5 {
    padding-bottom:.5rem;
}
</style>